<a href="https://colab.research.google.com/github/nmusuva/FEB-MySQL-data-challenge/blob/main/practicetables.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**DATABASES**


1. scalabilty :large sets in an organised manner
2. structure: defined relationships
3. data integrity
4. security
5. analytics and reporting : tableu on visualisation

In [1]:
%load_ext sql

importing the dataset chinook . helps to connect to our external database.

In [2]:
%sql sqlite:///chinook.db

EXPLORE THE DATABASE
Selecting the table names from our database

In [3]:
%sql SELECT name FROM sqlite_master WHERE type = 'table';

 * sqlite:///chinook.db
Done.

[('albums',),
 ('sqlite_sequence',),
 ('artists',),
 ('customers',),
 ('employees',),
 ('genres',),
 ('invoices',),
 ('invoice_items',),
 ('media_types',),
 ('playlists',),
 ('playlist_track',),
 ('tracks',),
 ('sqlite_stat1',)]

In [5]:
%sql PRAGMA table_info (albums);

 * sqlite:///chinook.db
Done.

[(0, 'AlbumId', 'INTEGER', 1, None, 1),
 (1, 'Title', 'NVARCHAR(160)', 1, None, 0),
 (2, 'ArtistId', 'INTEGER', 1, None, 0)]

In [6]:
%sql PRAGMA table_infor (media_types);

 * sqlite:///chinook.db
Done.

[]

In [8]:
%sql PRAGMA table_info (playlist_track);

 * sqlite:///chinook.db
Done.

[(0, 'PlaylistId', 'INTEGER', 1, None, 1),
 (1, 'TrackId', 'INTEGER', 1, None, 2)]

In [12]:
%sql PRAGMA table_info (employees);

 * sqlite:///chinook.db
Done.

[(0, 'EmployeeId', 'INTEGER', 1, None, 1),
 (1, 'LastName', 'NVARCHAR(20)', 1, None, 0),
 (2, 'FirstName', 'NVARCHAR(20)', 1, None, 0),
 (3, 'Title', 'NVARCHAR(30)', 0, None, 0),
 (4, 'ReportsTo', 'INTEGER', 0, None, 0),
 (5, 'BirthDate', 'DATETIME', 0, None, 0),
 (6, 'HireDate', 'DATETIME', 0, None, 0),
 (7, 'Address', 'NVARCHAR(70)', 0, None, 0),
 (8, 'City', 'NVARCHAR(40)', 0, None, 0),
 (9, 'State', 'NVARCHAR(40)', 0, None, 0),
 (10, 'Country', 'NVARCHAR(40)', 0, None, 0),
 (11, 'PostalCode', 'NVARCHAR(10)', 0, None, 0),
 (12, 'Phone', 'NVARCHAR(24)', 0, None, 0),
 (13, 'Fax', 'NVARCHAR(24)', 0, None, 0),
 (14, 'Email', 'NVARCHAR(60)', 0, None, 0)]

In [14]:
%sql PRAGMA table_info (genres);

 * sqlite:///chinook.db
Done.

[(0, 'GenreId', 'INTEGER', 1, None, 1),
 (1, 'Name', 'NVARCHAR(120)', 0, None, 0)]

In [16]:
%sql SELECT * FROM albums LIMIT 4;

 * sqlite:///chinook.db
Done.

[(1, 'For Those About To Rock We Salute You', 1),
 (2, 'Balls to the Wall', 2),
 (3, 'Restless and Wild', 2),
 (4, 'Let There Be Rock', 1)]

In [17]:
%sql SELECT * FROM genres LIMIT 4;

 * sqlite:///chinook.db
Done.

[(1, 'Rock'), (2, 'Jazz'), (3, 'Metal'), (4, 'Alternative & Punk')]

In [19]:
%sql SELECT Title FROM albums LIMIT 6;

 * sqlite:///chinook.db
Done.

[('For Those About To Rock We Salute You',),
 ('Balls to the Wall',),
 ('Restless and Wild',),
 ('Let There Be Rock',),
 ('Big Ones',),
 ('Jagged Little Pill',)]

In [24]:
%sql SELECT Title FROM employees LIMIT 5;

 * sqlite:///chinook.db
Done.

[('General Manager',),
 ('Sales Manager',),
 ('Sales Support Agent',),
 ('Sales Support Agent',),
 ('Sales Support Agent',)]

In [25]:
%sql SELECT * FROM employees ;

 * sqlite:///chinook.db
Done.

[(1, 'Adams', 'Andrew', 'General Manager', None, '1962-02-18 00:00:00', '2002-08-14 00:00:00', '11120 Jasper Ave NW', 'Edmonton', 'AB', 'Canada', 'T5K 2N1', '+1 (780) 428-9482', '+1 (780) 428-3457', 'andrew@chinookcorp.com'),
 (2, 'Edwards', 'Nancy', 'Sales Manager', 1, '1958-12-08 00:00:00', '2002-05-01 00:00:00', '825 8 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 2T3', '+1 (403) 262-3443', '+1 (403) 262-3322', 'nancy@chinookcorp.com'),
 (3, 'Peacock', 'Jane', 'Sales Support Agent', 2, '1973-08-29 00:00:00', '2002-04-01 00:00:00', '1111 6 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 5M5', '+1 (403) 262-3443', '+1 (403) 262-6712', 'jane@chinookcorp.com'),
 (4, 'Park', 'Margaret', 'Sales Support Agent', 2, '1947-09-19 00:00:00', '2003-05-03 00:00:00', '683 10 Street SW', 'Calgary', 'AB', 'Canada', 'T2P 5G3', '+1 (403) 263-4423', '+1 (403) 263-4289', 'margaret@chinookcorp.com'),
 (5, 'Johnson', 'Steve', 'Sales Support Agent', 2, '1965-03-03 00:00:00', '2003-10-17 00:00:00', '7727B 41 Ave', 'Calgary', 'AB', 'Canada', 'T3B 1Y7', '1 (780) 836-9987', '1 (780) 836-9543', 'steve@chinookcorp.com'),
 (6, 'Mitchell', 'Michael', 'IT Manager', 1, '1973-07-01 00:00:00', '2003-10-17 00:00:00', '5827 Bowness Road NW', 'Calgary', 'AB', 'Canada', 'T3B 0C5', '+1 (403) 246-9887', '+1 (403) 246-9899', 'michael@chinookcorp.com'),
 (7, 'King', 'Robert', 'IT Staff', 6, '1970-05-29 00:00:00', '2004-01-02 00:00:00', '590 Columbia Boulevard West', 'Lethbridge', 'AB', 'Canada', 'T1K 5N8', '+1 (403) 456-9986', '+1 (403) 456-8485', 'robert@chinookcorp.com'),
 (8, 'Callahan', 'Laura', 'IT Staff', 6, '1968-01-09 00:00:00', '2004-03-04 00:00:00', '923 7 ST NW', 'Lethbridge', 'AB', 'Canada', 'T1H 1Y8', '+1 (403) 467-3351', '+1 (403) 467-8772', 'laura@chinookcorp.com')]

In [26]:
%sql SELECT lastname FROM employees;

 * sqlite:///chinook.db
Done.

[('Adams',),
 ('Edwards',),
 ('Peacock',),
 ('Park',),
 ('Johnson',),
 ('Mitchell',),
 ('King',),
 ('Callahan',)]

**CREATING AND DELETING TABLES:**

In [27]:
%%sql CREATE TABLE worker(
    last_name VARCHAR (10),
    worker_id INT NOT NULL PRIMARY KEY,
    first_name VARCHAR (20),
    salary INT (16),
    department VARCHAR (20)
);

 * sqlite:///chinook.db
Done.

[]

**CONFIRMING THE CREATION OF THE TABLE**

In [28]:
%sql SELECT name FROM sqlite_master WHERE type =='table';

 * sqlite:///chinook.db
Done.

[('albums',),
 ('sqlite_sequence',),
 ('artists',),
 ('customers',),
 ('employees',),
 ('genres',),
 ('invoices',),
 ('invoice_items',),
 ('media_types',),
 ('playlists',),
 ('playlist_track',),
 ('tracks',),
 ('sqlite_stat1',),
 ('worker',)]

In [29]:
%sql SELECT * FROM worker;

 * sqlite:///chinook.db
Done.

[]

In [31]:
%sql PRAGMA table_info (worker);

 * sqlite:///chinook.db
Done.

[(0, 'last_name', 'VARCHAR (10)', 0, None, 0),
 (1, 'worker_id', 'INT', 1, None, 1),
 (2, 'first_name', 'VARCHAR (20)', 0, None, 0),
 (3, 'salary', 'INT (16)', 0, None, 0),
 (4, 'department', 'VARCHAR (20)', 0, None, 0)]

**DELETING A TABLE**

In [36]:
%sql

 * sqlite:///chinook.db
(sqlite3.OperationalError) near "WHERE": syntax error
[SQL: CREATE TABLE places WHERE type =='table';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)